import csv

# Список книг по программированию
header = ["Книга", "Автор", "Год выпуска"]
rows = [["Чистый код", "Роберт Мартин", "2021"],
        ["Искусство программирования", "Дональд Кнут", "2020"],
        ["Грокаем алгоритмы", "Адитья Бхаргава", "2021"],
        ["Алгоритмы. Построение и анализ", "Томас Кормен, Чарльз Лейзерсон, Рональд Ривест, Клиффорд Штайн", "2020"],
        ["Совершенный код", "Стив Макконнелл", "2017"]]

filename = "prog_books.csv"

with open(filename, "w", encoding="utf-8") as f:
    writer = csv.writer(f)
    writer.writerow(header)
    writer.writerows(rows)
